target/test-classes/xml/selfcare/viewsubscription/TC33952_createOrder

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ord1:createOrder type="NEW" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" correlationId="" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <account type="RESIDENTIAL">
                <contact type="BILLING" language="en_GB">
                    <title>Mr</title>
                    <firstName></firstName>
                    <lastName></lastName>
                    <telephoneNumbers defaultContact="daytime">
                        <daytime>0398403850</daytime>
                        <evening>0208619999</evening>
                        <mobile>02086999990</mobile>
                    </telephoneNumbers>
                    <emailAddress></emailAddress>
                    <birthDate>1975-01-01</birthDate>
                </contact>
                <billingAddress>
                    <buildingIdentifier>30</buildingIdentifier>
                    <addressLine1>LUKIN STREET</addressLine1>
                    <town>LONDON</town>
                    <country>United Kingdom</country>
                    <postcode>E10AA</postcode>
                    <ptc_abs_code>PTCABS23599440</ptc_abs_code>
                    <startDate>1980-08-08</startDate>
                </billingAddress>
                <accountDetail>
                    <username></username>
                    <password>password1</password>
                    <securityQuestion>Mothers maiden name?</securityQuestion>
                    <securityAnswer>smith</securityAnswer>
                </accountDetail>
                <billingDetail>
                    <billGroupId>422</billGroupId>
                    <preferredNotification>SMS</preferredNotification>
                    <paymentDetail type="CARD">
                        <creditCard>
                            <cardName>Card</cardName>
                            <cardNumber>4012001036273346</cardNumber>
                            <cardType>VI</cardType>
                            <cardExpiryDate>1222</cardExpiryDate>
                            <cvv>123</cvv>
                        </creditCard>
                    </paymentDetail>
                    <billFormat>SUMMARY</billFormat>
                    <clubcardNumber>634143330730912784</clubcardNumber>
                </billingDetail>
            </account>
            <verification runCreditCheck="true" termsAndConditionsAccepted="true" refundableDepositAccepted="false" acceptAgreement="true">
                <interconnect>
                    <param name="PAYASYOUGO"/>
                </interconnect>
            </verification>
            <orderDetail orderRef="12345" ipAddress="160.206.234.22" salesChannel="Onlines" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD">
                <dateTime>2011-06-10T16:44:31.0Z</dateTime>
                <!--1 or more repetitions:-->
                <orderItem id="1" dealSKU="DEAL-100" masterSubscription="true">
                    <serviceRef reference="Mobile 1"/>
                    <tariff productCode="FC24-2000-500">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="HTC-DESIRE-XXX-99">
                        <deliveryMethod>DELIVER</deliveryMethod>
                        <imei>359090017074582</imei>
                        <serialNumber>123152436457568486784684</serialNumber>
                        <agreement provider="AGRTESCOMOBILE">
                            <number>AGR12343256546745754778</number>
                        </agreement>
                    </device>
                    <discBundle productCode="00750-SB-A" bundleGroup="SB-GRP-A" billCapNotifications="false">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                    <insurance productCode="MA">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </insurance>
                </orderItem>
                <paymentRequest>
                    <cardName>CardName</cardName>
                    <cardNumber>4012001036273346</cardNumber>
                    <cardType>VI</cardType>
                    <cardExpiryDate>1222</cardExpiryDate>
                    <cvv>123</cvv>
                </paymentRequest>
            </orderDetail>
        </ord1:createOrder>
    </soapenv:Body>
</soapenv:Envelope>